# Part 1

In [2]:
# 3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [4]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [8]:
# Set path 
path = r'/Users/swapnilgadage/Documents/DataAnalytics/Achivment 4/06.11.2024_Instacart Basket Analysis'

In [12]:
# Import new customer data set from the 'Original Data' folder as a dataframe
customers = pd.read_csv(os.path.join(path, 'Data', 'Orignal Data', 'customers.csv'))

In [14]:
# 4. Wrangle the data so that it follows consistent logic; 
#for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [16]:
# Check the dimensions of the dataframe
customers.shape

(206209, 10)

In [18]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [20]:
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [22]:
# Rename the columns to establish uniformity
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [24]:
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [34]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [26]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [28]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [30]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [36]:
# Check columns is it coreectly renamed:
customers.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [38]:
# The columns have been successfully renamed.

In [42]:
customers.head(10)

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [44]:
# 5. Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; 
# for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [54]:
customers.dtypes

user_id           object
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [46]:
# Checking for mixed data-types in each column.
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [48]:
# The 'first_name' column has mixed data-types that need to be addressed.
customers['first_name'] = customers['first_name'].astype('str')

In [50]:
customers['user_id'] = customers['user_id'].astype('str')

In [56]:
# Re-check the data-types in the data frame and for mixed data-types.
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [58]:
# Now all columns are the appropriate data-types and no mixed data-types are present in any columns.

In [60]:
# Now check for missing data
customers.isnull().sum()

user_id           0
first_name        0
last_name         0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [62]:
# Check for duplicates
customers_dups = customers[customers.duplicated()]

In [64]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [66]:
# No duplicates available.

In [68]:
# Perform a descriptive statistic check to ensure everything looks normal
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [70]:
# There's nothing unusual present in the descriptive statistics.

In [72]:
# 6. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [86]:
# Import the rest of the prepared Instacart data
orders_products = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_combined_merged_new_variables_derived1.pkl'))

In [87]:
# Check the shape of the newly imported dataframe
orders_products.shape

(32404859, 21)

In [90]:
# Check the shape of the customers dataframe
customers.shape

(206209, 10)

In [92]:
# Identify a shared column
orders_products.head(5)

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,product_name,aisle_id,department_id,prices,match,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Soda,77,7,9.0,both,Regularly busy,Regularly busy,Average orders,10,New customer
1,2539329,1,prior,1,2,8,NaN,14084,2,0,...,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both,Regularly busy,Regularly busy,Average orders,10,New customer
2,2539329,1,prior,1,2,8,NaN,12427,3,0,...,Original Beef Jerky,23,19,4.4,both,Regularly busy,Regularly busy,Average orders,10,New customer
3,2539329,1,prior,1,2,8,NaN,26088,4,0,...,Aged White Cheddar Popcorn,23,19,4.7,both,Regularly busy,Regularly busy,Average orders,10,New customer
4,2539329,1,prior,1,2,8,NaN,26405,5,0,...,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both,Regularly busy,Regularly busy,Average orders,10,New customer

In [94]:
customers.head(5)

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [96]:
# Both dataframes share the 'user_id' column.

In [98]:
# Check data-type of shared column
orders_products.dtypes['user_id']

dtype('int64')

In [100]:
customers.dtypes['user_id']

dtype('O')

In [102]:
# Make sure both key columns are the same data type
orders_products['user_id'] = orders_products['user_id'].astype('str')

In [103]:
orders_products.dtypes['user_id']

dtype('O')

In [106]:
# The key columns now have matching data-types.

In [108]:
# Drop the existing '_merge' column from previous exercises
orders_products = orders_products.drop(columns=['_merge'])

In [110]:
# Merge the two dataframes using the column 'user_id'
custs_ords_prods = orders_products.merge(customers, on = 'user_id', indicator = True)

In [112]:
# Check shape of newly merged dataframe
custs_ords_prods.shape

(32404859, 30)

In [116]:
custs_ords_prods.columns

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'match', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'first_name',
       'last_name', 'gender', 'state', 'age', 'date_joined', 'n_dependants',
       'marital_status', 'income', '_merge'],
      dtype='object')

In [118]:
# Check inner join value counts
custs_ords_prods['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [120]:
# dataframes sucessfully merged.

In [122]:
# 8.Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [126]:
custs_ords_prods.to_pickle(os.path.join(path, 'Data','Prepared Data', 'orders_products_customers_merged_task9.pkl'))